_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 32)    320
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 32)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 32)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 32)      9248
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 32)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 32)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 32)      9248
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 32)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 32)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 32)      9248
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 32)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 123008)            0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               15745152
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 15,773,345
Trainable params: 15,773,345
Non-trainable params: 0

batch_size: 5
epochs: 1
Time: 100s/epoch


Training accuracy: 0.74
Training loss: 3.61

Validation: 
TN: 39
FN: 11
TP: 0
FPR: 0.0
MCC: nan
specificity: 1.0
precision: 0
accuracy: 0.78
NPV: 0.78
sensitivity: 0
total: 1.0
FP: 0
F1: 0
ROC: 0.0




--------------------------------------------------------------------------------------------------------



_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 32)    320
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 32)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 32)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 32)      9248
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 32)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 32)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 32)      9248
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 32)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 32)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 32)      9248
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 32)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 32)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 32)        9248
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 32)        9248
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 32)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 6272)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               802944
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 849,633
Trainable params: 849,633
Non-trainable params: 0


batch size: 5
epochs: 3
time: 100s/epoch

Training accuracy: 0.78
Training loss: 0.5718

Validation:
FPR: 0.0
accuracy: 0.78
NPV: 0.78
specificity: 1.0
FP: 0
TP: 0
precision: 0
FN: 11
F1: 0
sensitivity: 0
MCC: nan
TN: 39
ROC: 0.0
total: 1.0