optimizer: adam
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 32)    320
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 32)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 32)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 32)      9248
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 32)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 32)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 32)      9248
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 32)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 32)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 32)      9248
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 32)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 123008)            0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               15745152
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 15,773,345
Trainable params: 15,773,345
Non-trainable params: 0

batch_size: 5
epochs: 1
Time: 100s/epoch

Training size: 50 images
Training accuracy: 0.74
Training loss: 3.61

Validation: 
TN: 39
FN: 11
TP: 0
FPR: 0.0
MCC: nan
specificity: 1.0
precision: 0
accuracy: 0.78
NPV: 0.78
sensitivity: 0
total: 1.0
FP: 0
F1: 0
ROC: 0.0




--------------------------------------------------------------------------------------------------------
optimizer: adam


_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 32)    320
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 32)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 32)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 32)      9248
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 32)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 32)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 32)      9248
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 32)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 32)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 32)      9248
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 32)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 32)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 32)        9248
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 32)        9248
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 32)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 6272)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               802944
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 849,633
Trainable params: 849,633
Non-trainable params: 0


batch size: 5
epochs: 3
time: 100s/epoch

Training size: 50 images
Training accuracy: 0.78
Training loss: 0.5718

Validation:
FPR: 0.0
accuracy: 0.78
NPV: 0.78
specificity: 1.0
FP: 0
TP: 0
precision: 0
FN: 11
F1: 0
sensitivity: 0
MCC: nan
TN: 39
ROC: 0.0
total: 1.0


--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: adam

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 16)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 16)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 16)      2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 16)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 16)        2320
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 16)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 16)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 16)        2320
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               401536
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 413,425
Trainable params: 413,425
Non-trainable params: 0

batch size: 5
epochs: 3
time: 44s/epoch

Training size: 50 images
Training accuracy: 0.78
Training loss: 0.526

Validation:
sensitivity: 0
FP: 0
FN: 11
MCC: nan
precision: 0
ROC: 0.0
TP: 0
specificity: 1.0
FPR: 0.0
total: 1.0
NPV: 0.78
TN: 39
F1: 0
accuracy: 0.78


--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: adam

X_train: (100, 1024, 1024, 1)
X_validate: (100, 1024, 1024, 1)
X_test: (0, 1024, 1024, 1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 16)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 16)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 16)      2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 16)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 16)        2320
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 16)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 16)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 16)        2320
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               401536
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 413,425
Trainable params: 413,425
Non-trainable params: 0

batch size: 5
epochs: 3
time: 85s/epoch

Training size: 100 images
Training accuracy: 0.78
Training loss: 0.528

Validation:
[[69  0]
 [31  0]]

TP: 0
accuracy: 0.69
F1: 0
specificity: 1.0
FPR: 0.0
sensitivity: 0
TN: 69
MCC: nan
FP: 0
total: 1.0
NPV: 0.69
FN: 31
precision: 0
ROC: 0.0



--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: rmsprop

X_train: (100, 1024, 1024, 1)
X_validate: (100, 1024, 1024, 1)
X_test: (0, 1024, 1024, 1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 16)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 16)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 16)      2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 16)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 16)        2320
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 16)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 16)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 16)        2320
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               401536
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 413,425
Trainable params: 413,425
Non-trainable params: 0


batch size: 5
epochs: 3
time: 85s/epoch

Training size: 100 images
Training accuracy: 0.78
Training loss: 0.578

Validation:
[[69  0]
 [31  0]]

TP: 0
accuracy: 0.69
F1: 0
specificity: 1.0
FPR: 0.0
sensitivity: 0
TN: 69
MCC: nan
FP: 0
total: 1.0
NPV: 0.69
FN: 31
precision: 0
ROC: 0.0



--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: rmsprop

X_train: (140, 1024, 1024, 1)
X_validate: (40, 1024, 1024, 1)
X_test: (0, 1024, 1024, 1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 511, 511, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 511, 511, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 509, 509, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 254, 254, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 254, 254, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 252, 252, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 126, 126, 16)      0
_________________________________________________________________
dropout_3 (Dropout)          (None, 126, 126, 16)      0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 124, 124, 16)      2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 62, 62, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 16)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 60, 16)        2320
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 30, 30, 16)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 16)        0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 16)        2320
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               401536
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 413,425
Trainable params: 413,425
Non-trainable params: 0


batch size: 10
epochs: 3
time: 120s/epoch

Training size: 140 images
Training accuracy: 0.7357
Training loss: 0.7

Validation:
[[32  0]
 [ 8  0]]

TN: 32
FPR: 0.0
total: 1.0
sensitivity: 0
ROC: 0.0
accuracy: 0.8
precision: 0
F1: 0
MCC: nan
specificity: 1.0
FP: 0
FN: 8
NPV: 0.8
TP: 0



--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: rmsprop

X_train: (140, 1024, 1024, 1)
X_validate: (40, 1024, 1024, 1)
X_test: (20, 1024, 1024, 1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 340, 340, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 340, 340, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 338, 338, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 112, 112, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 112, 112, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 110, 110, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 36, 36, 16)        0
_________________________________________________________________
dropout_3 (Dropout)          (None, 36, 36, 16)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 34, 34, 16)        2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 11, 11, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 11, 11, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 1936)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               247936
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 255,185
Trainable params: 255,185
Non-trainable params: 0


batch size: 10
epochs: 3
time: 76s/epoch

Training size: 140 images
Training accuracy: 
Training loss: 

Validation:
[[32  0]
 [ 8  0]]


specificity: 1.0
TN: 32
FN: 8
total: 1.0
F1: 0
accuracy: 0.8
FPR: 0.0
TP: 0
NPV: 0.8
precision: 0
sensitivity: 0
ROC: 0.0
MCC: nan
FP: 0



--------------------------------------------------------------------------------------------------------
Convo_layer activation: relu
dense layer activation: relu
output activation: sigmoid
optimizer: rmsprop

X_train: (350, 1024, 1024, 1)
X_validate: (100, 1024, 1024, 1)
X_test: (50, 1024, 1024, 1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 1022, 1022, 16)    160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 340, 340, 16)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 340, 340, 16)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 338, 338, 16)      2320
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 112, 112, 16)      0
_________________________________________________________________
dropout_2 (Dropout)          (None, 112, 112, 16)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 110, 110, 16)      2320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 36, 36, 16)        0
_________________________________________________________________
dropout_3 (Dropout)          (None, 36, 36, 16)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 34, 34, 16)        2320
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 11, 11, 16)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 11, 11, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 1936)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               247936
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 255,185
Trainable params: 255,185
Non-trainable params: 0


batch size: 10
epochs: 3
time: 200s/epoch

Training size: 350 images
Training accuracy: 0.726
Training loss: 0.6

Validation:
[[77  0]
 [23  0]]

FP: 0
specificity: 1.0
FN: 23
precision: 0
F1: 0
total: 1.0
TP: 0
NPV: 0.77
TN: 77
ROC: 0.0
MCC: nan
accuracy: 0.77
FPR: 0.0
sensitivity: 0





-- U-NET --
Training: 70
Validation: 20

start_size = 16
pool_size = (2,2)
filter_size = (3,3)
conv_activation = "selu"
dense_activation = "selu"
output_activation = "sigmoid"
		
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 1)  0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 16) 160         input_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 16) 2320        conv2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 16) 64          conv2d_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 16) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 32) 4640        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 32) 9248        conv2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 256, 256, 32) 128         conv2d_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 128, 32) 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 64) 18496       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 64) 36928       conv2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 64) 256         conv2d_6[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 256, 256, 64) 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 256, 256, 32) 8224        up_sampling2d_1[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 256, 64) 0           conv2d_7[0][0]
                                                                 batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 256, 256, 32) 18464       concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 256, 32) 9248        conv2d_8[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 256, 256, 32) 128         conv2d_9[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 512, 512, 32) 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 512, 512, 16) 2064        up_sampling2d_2[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 512, 512, 32) 0           conv2d_10[0][0]
                                                                 batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 512, 512, 16) 4624        concatenate_2[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 512, 512, 16) 2320        conv2d_11[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 512, 512, 16) 64          conv2d_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 512, 512, 1)  17          batch_normalization_5[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 262144)       0           conv2d_13[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            262145      flatten_1[0][0]
==================================================================================================
Total params: 379,538
Trainable params: 379,218
Non-trainable params: 320
__________________________________________________________________________________________________
Epoch 1/5
7/7 [==============================] - 383s 55s/step - loss: 0.3218 - acc: 0.5143
Epoch 2/5
7/7 [==============================] - 423s 60s/step - loss: 0.1777 - acc: 0.7571
Epoch 3/5
7/7 [==============================] - 483s 69s/step - loss: 0.0809 - acc: 0.9143
Epoch 4/5
7/7 [==============================] - 599s 86s/step - loss: 0.0401 - acc: 0.9429
Epoch 5/5
7/7 [==============================] - 1070s 153s/step - loss: 0.0160 - acc: 1.0000
predictions: (20, 1)
validation: (20,)
Validation labels: [0 1 1 0 1 0 1 0 1 0]
Predicted labels: [[ 0.03209975]
 [ 0.41322422]
 [ 0.12299085]
 [ 0.05886265]
 [ 0.97942001]
 [ 0.30544108]
 [ 0.55314398]
 [ 0.01139736]
 [ 0.28112853]
 [ 0.05939822]]
Confusion matrix: 
[[6 4]
 [5 5]]

precision: 0.555555555556
FP: 4
ROC: 0.1
accuracy: 0.55
specificity: 0.6
sensitivity: 0.5
FN: 5
FPR: 0.4
MCC: 0.100503781526
NPV: 0.545454545455
total: 1.1
TP: 5
TN: 6
F1: 0.526315789474

